app/Controllers/Admin/Anggota.php

SELECT *
FROM `anggota`
ORDER BY `id_anggota` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `anggota`
---
    public function index()
    {
        $q = trim((string)($this->request->getGet('q') ?? ''));
        $perPage = 10;

        // siapkan builder untuk search
        $model = $this->anggota;
        if ($q !== '') {
            $model = $model->groupStart()
                ->like('id_anggota', $q)
                ->orLike('nama_depan', $q)
                ->orLike('nama_belakang', $q)
                ->orLike('jabatan', $q)
            ->groupEnd();
        }

        // ambil data dengan paginate (wajib agar $pager ada)
        $records = $model->orderBy('id_anggota','DESC')->paginate($perPage);

INSERT INTO `anggota` (`gelar_depan`, `nama_depan`, `nama_belakang`, `gelar_belakang`, `jabatan`, `status_pernikahan`) VALUES ('S.T', 'Aku', 'DPR', 'M.T', 'Anggota', 'Kawin')
---
    public function store()
    {
        if (! $this->validate($this->rules())) {
            return redirect()->back()->withInput()->with('error', $this->validator->listErrors());
        }

        $this->anggota->insert([
            'gelar_depan'       => trim((string)$this->request->getPost('gelar_depan')),
            'nama_depan'        => trim((string)$this->request->getPost('nama_depan')),
            'nama_belakang'     => trim((string)$this->request->getPost('nama_belakang')),
            'gelar_belakang'    => trim((string)$this->request->getPost('gelar_belakang')),
            'jabatan'           => (string)$this->request->getPost('jabatan'),
            'status_pernikahan' => (string)$this->request->getPost('status_pernikahan'),
        ]);