app/Controllers/Auth.php

    public function attempt()
    {
        $login    = trim((string)$this->request->getPost('username')); // username/email
        $password = (string)$this->request->getPost('password');

        if ($login === '' || $password === '') {
            return redirect()->back()->with('error', 'Username & password wajib diisi.');
        }

        $model = new PenggunaModel();

        // cari berdasarkan username ATAU email
        $user = $model->groupStart()
                        ->where('username', $login)
                        ->orWhere('email', $login)
                      ->groupEnd()
                      ->first();
---
SELECT *
FROM `pengguna`
WHERE   (
`username` = 'citizen'
OR `email` = 'citizen'
 )
 LIMIT 1