app/Controllers/Dashboard.php

    public function admin()
    {
        $stats = ['anggota' => 0, 'komponen' => 0, 'penggajian' => 0];

        // selalu ada
        $stats['anggota'] = (new \App\Models\AnggotaModel())->countAllResults();

        // opsional: hanya kalau modelnya sudah ada
        if (class_exists(\App\Models\KomponenModel::class)) {
            $stats['komponen'] = (new \App\Models\KomponenModel())->countAllResults();
        }
        if (class_exists(\App\Models\PenggajianListModel::class)) {
            $stats['penggajian'] = (new \App\Models\PenggajianListModel())->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `penggajian`
SELECT COUNT(*) AS `numrows`
FROM `anggota`