app/Controllers/Komponen.php

SELECT *
FROM `komponen_gaji`
ORDER BY `id_komponen_gaji` ASC
SELECT *
FROM `komponen_gaji`
ORDER BY `id_komponen_gaji` ASC
 LIMIT 20, 10
SELECT COUNT(*) AS `numrows`
FROM `komponen_gaji`
---
    public function index()
    {
        $q = trim((string) $this->request->getGet('q'));

        $m = $this->komponen->orderBy('id_komponen_gaji','ASC');

        if ($q !== '') {
            $m = $m->groupStart()
                    ->like('id_komponen_gaji', $q)
                    ->orLike('nama_komponen', $q)
                    ->orLike('kategori', $q)
                    ->orLike('jabatan', $q)
                    ->orLike('nominal', $q)
                    ->orLike('satuan', $q)
                  ->groupEnd();
        }

        // pakai group pager khusus biar rapi
        $rows  = $m->paginate(10, 'komponen');