app/Controllers/Penggajian.php

    public function create()
    {
        $idAnggota = (int) ($this->request->getGet('id_anggota') ?? 0);

        $anggotaOptions = (new \App\Models\AnggotaModel())
        ->select('id_anggota, gelar_depan, nama_depan, nama_belakang, gelar_belakang, jabatan, status_pernikahan, jumlah_anak')
        ->orderBy('id_anggota','ASC')
        ->findAll();   // ← harus findAll() tanpa angka


        $anggota = null;
        $komponen = [];
        if ($idAnggota) {
            $anggota = $this->anggota->find($idAnggota);
---
SELECT `id_anggota`, `gelar_depan`, `nama_depan`, `nama_belakang`, `gelar_belakang`, `jabatan`, `status_pernikahan`, `jumlah_anak`
FROM `anggota`
ORDER BY `id_anggota` ASC
SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = 106

    public function store()
    {
        $idAnggota = (int) $this->request->getPost('id_anggota');
        $selected  = $this->request->getPost('komponen') ?? [];

        if (!$idAnggota || empty($selected)) {
            return redirect()->back()->withInput()->with('error', 'Pilih anggota dan minimal satu komponen.');
        }

        $anggota = $this->anggota->find($idAnggota);
        if (!$anggota) {
            return redirect()->back()->withInput()->with('error', 'Anggota tidak valid.');
        }

        // Validasi: hanya komponen untuk jabatan anggota atau 'Semua'
        $allowedIds = array_column(
            $this->komponen
                ->groupStart()->where('jabatan', $anggota['jabatan'])->orWhere('jabatan','Semua')->groupEnd()
                ->findAll(),
            'id_komponen_gaji'
        );
---
SELECT *
FROM `komponen_gaji`
WHERE   (
`jabatan` = 'Anggota'
OR `jabatan` = 'Semua'
 )


        // Tulis dengan INSERT IGNORE agar duplikat dilewati tanpa error
        $tbl = $db->table('penggajian')->ignore(true);
        $tbl->insertBatch($rows);
---
INSERT IGNORE INTO `penggajian` (`id_anggota`, `id_komponen_gaji`)
VALUES (116,203), (116,205), (116,210), (116,204), (116,209), (116,206), (116,223), (116,222), (116,225), (116,221), (116,215), (116,218), (116,224)