app/Controllers/Penggajian.php

SELECT `a`.`id_anggota`, `a`.`gelar_depan`, `a`.`nama_depan`, `a`.`nama_belakang`, `a`.`gelar_belakang`, `a`.`jabatan`, `a`.`status_pernikahan`, `a`.`jumlah_anak`, COALESCE(SUM( (kg.nominal * CASE LOWER(kg.satuan)
                    WHEN 'bulan'   THEN 1
                    WHEN 'hari'    THEN 22
                    WHEN 'periode' THEN 1
                    ELSE 1
                END) ),0) AS plus_bln, 0 AS `minus_bln`, COALESCE(SUM( CASE WHEN kg.kategori = 'Gaji Pokok'
                                     THEN (kg.nominal * CASE LOWER(kg.satuan)
                    WHEN 'bulan'   THEN 1
                    WHEN 'hari'    THEN 22
                    WHEN 'periode' THEN 1
                    ELSE 1
                END) ELSE 0 END),0) AS gaji_pokok_bln
FROM `anggota` `a`
LEFT JOIN `penggajian` `pg` ON `pg`.`id_anggota` = `a`.`id_anggota`
LEFT JOIN `komponen_gaji` `kg` ON `kg`.`id_komponen_gaji` = `pg`.`id_komponen_gaji`
GROUP BY `a`.`id_anggota`
ORDER BY `a`.`id_anggota` ASC
---
    public function index()
    {
        $db = db_connect();

        // aturan tunjangan keluarga
        $PASANGAN_PCT = 0.10; // 10% dari gaji pokok bulanan
        $ANAK_PCT     = 0.02; // 2% per anak
        $ANAK_MAX     = 2;    // maksimal 2 anak

        // normalisasi satuan -> bulanan (Bulan=1, Hari≈22 hari kerja, Periode=1)
        $mul = "CASE LOWER(kg.satuan)
                    WHEN 'bulan'   THEN 1
                    WHEN 'hari'    THEN 22
                    WHEN 'periode' THEN 1
                    ELSE 1
                END";

        // ambil semua anggota + komponen yang sudah dipasang (pivot: penggajian)
        $rows = $db->table('anggota a')
            ->select([
                'a.id_anggota','a.gelar_depan','a.nama_depan','a.nama_belakang','a.gelar_belakang',
                'a.jabatan','a.status_pernikahan','a.jumlah_anak',

                // semua komponen dianggap tambahan
                "COALESCE(SUM( (kg.nominal * $mul) ),0) AS plus_bln",

                // tidak ada potongan di skema ini
                "0 AS minus_bln",

                // gaji pokok = kategori 'Gaji Pokok'
                "COALESCE(SUM( CASE WHEN kg.kategori = 'Gaji Pokok'
                                     THEN (kg.nominal * $mul) ELSE 0 END),0) AS gaji_pokok_bln",
            ])
            ->join('penggajian pg',   'pg.id_anggota = a.id_anggota', 'left')
            ->join('komponen_gaji kg','kg.id_komponen_gaji = pg.id_komponen_gaji', 'left')
            ->groupBy('a.id_anggota')
            ->orderBy('a.id_anggota','ASC')
            ->get()->getResultArray();