app/Controllers/Penggajian.php

SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = 116
---
    ->groupEnd();
    }

    $rows = $builder
    ->orderBy('a.id_anggota','ASC')
    ->get()->getResultArray();

SELECT `id_anggota`, `gelar_depan`, `nama_depan`, `nama_belakang`, `gelar_belakang`, `jabatan`, `status_pernikahan`, `jumlah_anak`
FROM `anggota`
ORDER BY `id_anggota` ASC
SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = 103
SELECT `id_komponen_gaji`
FROM `penggajian`
WHERE `id_anggota` = 103
---
    public function create()
    {
        $db = db_connect(); // <-- tambahkan

        $idAnggota = (int) ($this->request->getGet('id_anggota') ?? 0);

        // kalau mau aman juga, pastikan model terisi
        $this->anggota  = $this->anggota  ?? new \App\Models\AnggotaModel();
        $this->komponen = $this->komponen ?? new \App\Models\KomponenModel();

        $anggotaOptions = $this->anggota
            ->select('id_anggota, gelar_depan, nama_depan, nama_belakang, gelar_belakang, jabatan, status_pernikahan, jumlah_anak')
            ->orderBy('id_anggota','ASC')
            ->findAll();

        $anggota  = null;
        $komponen = [];
        $existing = [];

        if ($idAnggota) {
            $anggota = $this->anggota->find($idAnggota);
            if ($anggota) {
                $komponen = $this->komponen
                    ->groupStart()->where('jabatan', $anggota['jabatan'])->orWhere('jabatan','Semua')->groupEnd()
                    ->orderBy('kategori','ASC')->orderBy('nama_komponen','ASC')
                    ->findAll();

                // pakai $db, bukan $this->db
                $existing = array_column(
                    $db->table('penggajian')
                       ->select('id_komponen_gaji')
                       ->where('id_anggota', $idAnggota)
                       ->get()->getResultArray(),
                    'id_komponen_gaji'
                );

SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = 103
SELECT *
FROM `komponen_gaji`
WHERE   (
`jabatan` = 'Anggota'
OR `jabatan` = 'Semua'
 )
---
    public function store()
    {
        $db = db_connect(); // <-- tambahkan

        $idAnggota = (int) $this->request->getPost('id_anggota');
        $selected  = $this->request->getPost('komponen') ?? [];

        if (!$idAnggota || empty($selected)) {
            return redirect()->back()->withInput()->with('error','Pilih anggota dan minimal satu komponen.');
        }

        $this->anggota  = $this->anggota  ?? new \App\Models\AnggotaModel();
        $this->komponen = $this->komponen ?? new \App\Models\KomponenModel();

        $anggota = $this->anggota->find($idAnggota);
        if (!$anggota) {
            return redirect()->back()->withInput()->with('error','Anggota tidak valid.');
        }

        $allowedIds = array_column(
            $this->komponen
                ->groupStart()->where('jabatan', $anggota['jabatan'])->orWhere('jabatan','Semua')->groupEnd()
                ->findAll(),
            'id_komponen_gaji'
        );

SELECT `id_komponen_gaji`
FROM `penggajian`
WHERE `id_anggota` = 103
---
        }

        // pakai $db, bukan $this->db
        $existingIds = array_column(
            $db->table('penggajian')
               ->select('id_komponen_gaji')
               ->where('id_anggota', $idAnggota)
               ->get()->getResultArray(),
            'id_komponen_gaji'
        );

INSERT INTO `penggajian` (`id_anggota`, `id_komponen_gaji`)
VALUES (103,203), (103,205), (103,210), (103,204), (103,209), (103,206), (103,223), (103,222), (103,225), (103,221), (103,215), (103,218), (103,224)
---
        ], $newIds);

        $db->transStart();
        $db->table('penggajian')->insertBatch($rows);

SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = 116
SELECT *
FROM `komponen_gaji`
WHERE   (
`jabatan` = 'Anggota'
OR `jabatan` = 'Semua'
 )
SELECT `id_komponen_gaji`
FROM `penggajian`
WHERE `id_anggota` = 116
---
    public function update(int $idAnggota)
    {
        $db = db_connect();

        $a = $this->anggota->find($idAnggota);
        if (!$a) return redirect()->to(site_url('admin/penggajian'))->with('error','Anggota tidak ditemukan.');

        $picked = array_map('intval', $this->request->getPost('komponen') ?? []);

        // validasi hanya {jabatan anggota} ∪ {Semua}
        $allowedIds = array_column(
            $this->komponen
                ->groupStart()->where('jabatan', $a['jabatan'])->orWhere('jabatan','Semua')->groupEnd()
                ->findAll(),
            'id_komponen_gaji'
        );
        $notAllowed = array_diff($picked, $allowedIds);
        if ($notAllowed) {
            return redirect()->back()->withInput()->with('error','Ada komponen yang tidak sesuai jabatan.');
        }

        $current = array_column(
            $db->table('penggajian')->select('id_komponen_gaji')->where('id_anggota', $idAnggota)->get()->getResultArray(),
            'id_komponen_gaji'
        );

INSERT INTO `penggajian` (`id_anggota`, `id_komponen_gaji`)
VALUES (116,205)
---
        $db->transStart();
        if ($toAdd) {
            $rows = array_map(fn($idK)=>['id_anggota'=>$idAnggota,'id_komponen_gaji'=>$idK], $toAdd);
            $db->table('penggajian')->insertBatch($rows);