app/Controllers/PublicPenggajian.php

        $offset  = ($page - 1) * $perPage;

        $rows  = $builder->get($perPage, $offset)->getResultArray();
        $total = $db->table('penggajian')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `penggajian`