app/Controllers/PublicAnggota.php

SELECT COUNT(*) AS `numrows`
FROM `anggota`
---


        // gunakan group 'anggota' untuk pager
        $rows  = $builder->orderBy('id_anggota','ASC')->paginate($perPage, 'anggota');