app/Models/AnggotaModel.php

    public function searchPaginated(?string $q, int $perPage = 10)
    {
        $builder = $this->builder();

        if ($q && $q !== '') {
            $q = trim($q);
            $builder->groupStart();
            foreach ($this->searchable as $i => $col) {
                if ($i === 0) {
                    // allow exact or partial for id_anggota
                    $builder->like($col, $q);
                } else {
                    $builder->orLike($col, $q);
                }
            }
            $builder->groupEnd();
        }

        // urutkan nama depan lalu belakang
        $builder->orderBy('nama_depan', 'ASC')->orderBy('nama_belakang', 'ASC');

        return $builder->get()->getResultArray();
---
SELECT *
FROM `anggota`
ORDER BY `nama_depan` ASC, `nama_belakang` ASC